tap "anomalyco/tap"
tap "shivammathur/extensions"
tap "shivammathur/php", trusted: true
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Terminal countdown timer
brew "countdown"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Create, run, and share large language models (LLMs)
brew "ollama"
# General-purpose scripting language
brew "php@8.2"
# CLI for Playwright: record/generate code, inspect selectors, take screenshots
brew "playwright-cli"
# General-purpose scripting language
brew "shivammathur/php/php"
# General-purpose scripting language
brew "shivammathur/php/php@8.1"
# Image editing and design software
cask "affinity"
# Application uninstaller
cask "appcleaner"
# Scriptable scratchpad for developers
cask "boop"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Universal database tool and SQL client
cask "dbeaver-community"
# Database version management tool
cask "dbngin"
# Screenshot software with built-in annotation tools
cask "flameshot"
# Desktop client for GitHub repositories
cask "github"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Password manager app
cask "keepassxc"
# App to write, plan, collaborate, and get organised
cask "notion"
# AI coding agent desktop client
cask "opencode-desktop"
# PHP IDE by JetBrains
cask "phpstorm"
# Collaboration platform for API development
cask "postman"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "angular.ng-template"
vscode "astro-build.astro-vscode"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "christian-kohler.path-intellisense"
vscode "codingyu.laravel-goto-view"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "damms005.devdb"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "github.vscode-github-actions"
vscode "glitchbl.laravel-create-view"
vscode "ihunte.laravel-blade-wrapper"
vscode "laravel.vscode-laravel"
vscode "mikestead.dotenv"
vscode "mohamedbenhida.laravel-intellisense"
vscode "ms-ceintl.vscode-language-pack-es"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "naoray.laravel-goto-components"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel-extension-pack"
vscode "onecentlin.laravel5-snippets"
vscode "pgl.laravel-jump-controller"
vscode "pkief.material-icon-theme"
vscode "rust-lang.rust-analyzer"
vscode "ryannaddy.laravel-artisan"
vscode "shufo.vscode-blade-formatter"
vscode "vue.volar"
vscode "xdebug.php-debug"
