amiralizadeh9480.laravel-extra-intellisense
angular.ng-template
astro-build.astro-vscode
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
chadalen.vscode-jetbrains-icon-theme
christian-kohler.path-intellisense
codingyu.laravel-goto-view
cweijan.dbclient-jdbc
cweijan.vscode-mysql-client2
damms005.devdb
eamodio.gitlens
editorconfig.editorconfig
github.vscode-github-actions
glitchbl.laravel-create-view
ihunte.laravel-blade-wrapper
laravel.vscode-laravel
mikestead.dotenv
mohamedbenhida.laravel-intellisense
ms-ceintl.vscode-language-pack-es
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
naoray.laravel-goto-components
onecentlin.laravel-blade
onecentlin.laravel-extension-pack
onecentlin.laravel5-snippets
pgl.laravel-jump-controller
pkief.material-icon-theme
rust-lang.rust-analyzer
ryannaddy.laravel-artisan
shufo.vscode-blade-formatter
vue.volar
xdebug.php-debug
